
Функция СформироватьКлючДокумента(ДокументОбъект)
	
	// Состав ключа:
	// БанковскийСчет
	// Сумма
	// "+" или "-" взависимости от приход/расход
	// ИНН (УНП) контрагента
	// НомерДокумента - 
	// ДатаДокумента
	// ДатаОперации - дата проведения по банку
	
	рез = "";
	
	БанковскийСчет = СокрЛП(ДокументОбъект.БанковскийСчет.НомерСчета);
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручение") Тогда
		
		Сумма = СокрЛП(ДокументОбъект.СуммаДокумента);
		ТипДокумента = "-";
		ИНН = СокрЛП(ДокументОбъект.ИННПолучателя);
		//НомерДокумента = СокрЛП(ДокументОбъект.Номер);
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОбъект.Номер, Истина);
		//НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(ДокументОбъект.Номер, "00НФ");
		ДатаДокумента = СокрЛП(НачалоДня(ДокументОбъект.Дата));
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеНаСчет") Тогда
		
		Сумма = СокрЛП(ДокументОбъект.СуммаДокумента);
		ТипДокумента = "+";
		ИНН = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент), СокрЛП(ДокументОбъект.Контрагент.ИНН), "");
		НомерДокумента = СокрЛП(ДокументОбъект.НомерВходящегоДокумента);
		ДатаДокумента = СокрЛП(ДокументОбъект.ДатаВходящегоДокумента);
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходСоСчета") Тогда	
		
		Сумма = СокрЛП(ДокументОбъект.СуммаДокумента);
		ТипДокумента = "-";
		ИНН = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент), СокрЛП(ДокументОбъект.Контрагент.ИНН), "");
		НомерДокумента = СокрЛП(ДокументОбъект.НомерВходящегоДокумента);
		ДатаДокумента = СокрЛП(ДокументОбъект.ДатаВходящегоДокумента);
		
	Иначе
		
		Сумма = 0;
		ТипДокумента = "?";
		
	КонецЕсли;
	
	Сумма = СокрЛП(Сумма);
	ДатаОперации = СокрЛП(НачалоДня(ДокументОбъект.Дата));
	
	рез = БанковскийСчет + Сумма + ТипДокумента + ИНН + НомерДокумента + ДатаДокумента + ДатаОперации;
	
	возврат рез;
	
КонецФункции // СформироватьКлючДокумента()

Процедура db_ПриЗаписиБанковскогоДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.db_Ключ = СформироватьКлючДокумента(Источник);
	
КонецПроцедуры
